circular-cylinder-re110-B/system/blockMeshDict
// Mesh generated on 08-Mar-2021
// Local directory: /Users/fbisetti/teaching/ASE347/SP-2021/OF-assignments/of2/simulations/mesh
// Username: fbisetti


// Lf (fore)  =  4.00000e+00
// Lw (wake)  =  6.00000e+00
// R  (outer) =  1.00000e+00
// H  (top/bottom) = 4.00000

FoamFile
{
	version  2.0;
	format   ascii;
	class    dictionary;
	object   blockMeshDict;
}

convertToMeters 1.0;

vertices
(
	( 5.000000e-01 0.000000e+00 -5.000000e-02 ) // 0
	( 3.535534e-01 3.535534e-01 -5.000000e-02 ) // 1
	( 3.061617e-17 5.000000e-01 -5.000000e-02 ) // 2
	( -3.535534e-01 3.535534e-01 -5.000000e-02 ) // 3
	( -5.000000e-01 6.123234e-17 -5.000000e-02 ) // 4
	( -3.535534e-01 -3.535534e-01 -5.000000e-02 ) // 5
	( -9.184851e-17 -5.000000e-01 -5.000000e-02 ) // 6
	( 3.535534e-01 -3.535534e-01 -5.000000e-02 ) // 7
	( 1.500000e+00 0.000000e+00 -5.000000e-02 ) // 8
	( 1.060660e+00 1.060660e+00 -5.000000e-02 ) // 9
	( 9.184851e-17 1.500000e+00 -5.000000e-02 ) // 10
	( -1.060660e+00 1.060660e+00 -5.000000e-02 ) // 11
	( -1.500000e+00 1.836970e-16 -5.000000e-02 ) // 12
	( -1.060660e+00 -1.060660e+00 -5.000000e-02 ) // 13
	( -2.755455e-16 -1.500000e+00 -5.000000e-02 ) // 14
	( 1.060660e+00 -1.060660e+00 -5.000000e-02 ) // 15
	( 4.000000e+00 0.000000e+00 -5.000000e-02 ) // 16
	( 4.000000e+00 1.060660e+00 -5.000000e-02 ) // 17
	( 4.000000e+00 4.000000e+00 -5.000000e-02 ) // 18
	( 1.060660e+00 4.000000e+00 -5.000000e-02 ) // 19
	( 0.000000e+00 4.000000e+00 -5.000000e-02 ) // 20
	( -1.060660e+00 4.000000e+00 -5.000000e-02 ) // 21
	( -4.000000e+00 4.000000e+00 -5.000000e-02 ) // 22
	( -4.000000e+00 1.060660e+00 -5.000000e-02 ) // 23
	( -4.000000e+00 0.000000e+00 -5.000000e-02 ) // 24
	( -4.000000e+00 -1.060660e+00 -5.000000e-02 ) // 25
	( -4.000000e+00 -4.000000e+00 -5.000000e-02 ) // 26
	( -1.060660e+00 -4.000000e+00 -5.000000e-02 ) // 27
	( 0.000000e+00 -4.000000e+00 -5.000000e-02 ) // 28
	( 1.060660e+00 -4.000000e+00 -5.000000e-02 ) // 29
	( 4.000000e+00 -4.000000e+00 -5.000000e-02 ) // 30
	( 4.000000e+00 -1.060660e+00 -5.000000e-02 ) // 31
	( 5.000000e-01 0.000000e+00 5.000000e-02 ) // 32
	( 3.535534e-01 3.535534e-01 5.000000e-02 ) // 33
	( 3.061617e-17 5.000000e-01 5.000000e-02 ) // 34
	( -3.535534e-01 3.535534e-01 5.000000e-02 ) // 35
	( -5.000000e-01 6.123234e-17 5.000000e-02 ) // 36
	( -3.535534e-01 -3.535534e-01 5.000000e-02 ) // 37
	( -9.184851e-17 -5.000000e-01 5.000000e-02 ) // 38
	( 3.535534e-01 -3.535534e-01 5.000000e-02 ) // 39
	( 1.500000e+00 0.000000e+00 5.000000e-02 ) // 40
	( 1.060660e+00 1.060660e+00 5.000000e-02 ) // 41
	( 9.184851e-17 1.500000e+00 5.000000e-02 ) // 42
	( -1.060660e+00 1.060660e+00 5.000000e-02 ) // 43
	( -1.500000e+00 1.836970e-16 5.000000e-02 ) // 44
	( -1.060660e+00 -1.060660e+00 5.000000e-02 ) // 45
	( -2.755455e-16 -1.500000e+00 5.000000e-02 ) // 46
	( 1.060660e+00 -1.060660e+00 5.000000e-02 ) // 47
	( 4.000000e+00 0.000000e+00 5.000000e-02 ) // 48
	( 4.000000e+00 1.060660e+00 5.000000e-02 ) // 49
	( 4.000000e+00 4.000000e+00 5.000000e-02 ) // 50
	( 1.060660e+00 4.000000e+00 5.000000e-02 ) // 51
	( 0.000000e+00 4.000000e+00 5.000000e-02 ) // 52
	( -1.060660e+00 4.000000e+00 5.000000e-02 ) // 53
	( -4.000000e+00 4.000000e+00 5.000000e-02 ) // 54
	( -4.000000e+00 1.060660e+00 5.000000e-02 ) // 55
	( -4.000000e+00 0.000000e+00 5.000000e-02 ) // 56
	( -4.000000e+00 -1.060660e+00 5.000000e-02 ) // 57
	( -4.000000e+00 -4.000000e+00 5.000000e-02 ) // 58
	( -1.060660e+00 -4.000000e+00 5.000000e-02 ) // 59
	( 0.000000e+00 -4.000000e+00 5.000000e-02 ) // 60
	( 1.060660e+00 -4.000000e+00 5.000000e-02 ) // 61
	( 4.000000e+00 -4.000000e+00 5.000000e-02 ) // 62
	( 4.000000e+00 -1.060660e+00 5.000000e-02 ) // 63
);

blocks
(

	// block 0 
	hex ( 0  8  9  1 32 40 41 33) ( 14 28  1) simpleGrading ( 2.000000e+00 1.000000e+00 1.0)
	// block 1 
	hex ( 1  9 10  2 33 41 42 34) ( 14 28  1) simpleGrading ( 2.000000e+00 1.000000e+00 1.0)
	// block 2 
	hex ( 2 10 11  3 34 42 43 35) ( 14 28  1) simpleGrading ( 2.000000e+00 1.000000e+00 1.0)
	// block 3 
	hex ( 3 11 12  4 35 43 44 36) ( 14 28  1) simpleGrading ( 2.000000e+00 1.000000e+00 1.0)
	// block 4 
	hex ( 4 12 13  5 36 44 45 37) ( 14 28  1) simpleGrading ( 2.000000e+00 1.000000e+00 1.0)
	// block 5 
	hex ( 5 13 14  6 37 45 46 38) ( 14 28  1) simpleGrading ( 2.000000e+00 1.000000e+00 1.0)
	// block 6 
	hex ( 6 14 15  7 38 46 47 39) ( 14 28  1) simpleGrading ( 2.000000e+00 1.000000e+00 1.0)
	// block 7 
	hex ( 7 15  8  0 39 47 40 32) ( 14 28  1) simpleGrading ( 2.000000e+00 1.000000e+00 1.0)
	// block 8 
	hex ( 8 16 17  9 40 48 49 41) ( 42 28  1) simpleGrading ( 4.000000e+00 1.000000e+00 1.0)
	// block 9 
	hex ( 9 17 18 19 41 49 50 51) ( 42 42  1) simpleGrading ( 4.000000e+00 4.000000e+00 1.0)
	// block 10 
	hex (10  9 19 20 42 41 51 52) ( 28 42  1) simpleGrading ( 1.000000e+00 4.000000e+00 1.0)
	// block 11 
	hex (11 10 20 21 43 42 52 53) ( 28 42  1) simpleGrading ( 1.000000e+00 4.000000e+00 1.0)
	// block 12 
	hex (23 11 21 22 55 43 53 54) ( 21 42  1) simpleGrading ( 2.500000e-01 4.000000e+00 1.0)
	// block 13 
	hex (24 12 11 23 56 44 43 55) ( 21 28  1) simpleGrading ( 2.500000e-01 1.000000e+00 1.0)
	// block 14 
	hex (25 13 12 24 57 45 44 56) ( 21 28  1) simpleGrading ( 2.400000e-01 1.000000e+00 1.0)
	// block 15 
	hex (26 27 13 25 58 59 45 57) ( 21 42  1) simpleGrading ( 2.500000e-01 2.500000e-01 1.0)
	// block 16 
	hex (27 28 14 13 59 60 46 45) ( 28 42  1) simpleGrading ( 1.000000e+00 2.500000e-01 1.0)
	// block 17 
	hex (28 29 15 14 60 61 47 46) ( 28 42  1) simpleGrading ( 1.000000e+00 2.500000e-01 1.0)
	// block 18 
	hex (29 30 31 15 61 62 63 47) ( 42 42  1) simpleGrading ( 4.000000e+00 2.500000e-01 1.0)
	// block 19 
	hex (15 31 16  8 47 63 48 40) ( 42 28  1) simpleGrading ( 4.000000e+00 1.000000e+00 1.0)

);

edges
(

arc  0  1 ( 4.619398e-01 1.913417e-01 -5.000000e-02 )
arc  8  9 ( 1.385819e+00 5.740251e-01 -5.000000e-02 )
arc 32 33 ( 4.619398e-01 1.913417e-01 5.000000e-02 )
arc 40 41 ( 1.385819e+00 5.740251e-01 5.000000e-02 )
arc  1  2 ( 1.913417e-01 4.619398e-01 -5.000000e-02 )
arc  9 10 ( 5.740251e-01 1.385819e+00 -5.000000e-02 )
arc 33 34 ( 1.913417e-01 4.619398e-01 5.000000e-02 )
arc 41 42 ( 5.740251e-01 1.385819e+00 5.000000e-02 )
arc  2  3 ( -1.913417e-01 4.619398e-01 -5.000000e-02 )
arc 10 11 ( -5.740251e-01 1.385819e+00 -5.000000e-02 )
arc 34 35 ( -1.913417e-01 4.619398e-01 5.000000e-02 )
arc 42 43 ( -5.740251e-01 1.385819e+00 5.000000e-02 )
arc  3  4 ( -4.619398e-01 1.913417e-01 -5.000000e-02 )
arc 11 12 ( -1.385819e+00 5.740251e-01 -5.000000e-02 )
arc 35 36 ( -4.619398e-01 1.913417e-01 5.000000e-02 )
arc 43 44 ( -1.385819e+00 5.740251e-01 5.000000e-02 )
arc  4  5 ( -4.619398e-01 -1.913417e-01 -5.000000e-02 )
arc 12 13 ( -1.385819e+00 -5.740251e-01 -5.000000e-02 )
arc 36 37 ( -4.619398e-01 -1.913417e-01 5.000000e-02 )
arc 44 45 ( -1.385819e+00 -5.740251e-01 5.000000e-02 )
arc  5  6 ( -1.913417e-01 -4.619398e-01 -5.000000e-02 )
arc 13 14 ( -5.740251e-01 -1.385819e+00 -5.000000e-02 )
arc 37 38 ( -1.913417e-01 -4.619398e-01 5.000000e-02 )
arc 45 46 ( -5.740251e-01 -1.385819e+00 5.000000e-02 )
arc  6  7 ( 1.913417e-01 -4.619398e-01 -5.000000e-02 )
arc 14 15 ( 5.740251e-01 -1.385819e+00 -5.000000e-02 )
arc 38 39 ( 1.913417e-01 -4.619398e-01 5.000000e-02 )
arc 46 47 ( 5.740251e-01 -1.385819e+00 5.000000e-02 )
arc  7  0 ( 4.619398e-01 -1.913417e-01 -5.000000e-02 )
arc 15  8 ( 1.385819e+00 -5.740251e-01 -5.000000e-02 )
arc 39 32 ( 4.619398e-01 -1.913417e-01 5.000000e-02 )
arc 47 40 ( 1.385819e+00 -5.740251e-01 5.000000e-02 )


);

boundary
(

	inlet
	{
		type patch;
		faces
		(
			(22 54 55 23)
			(23 55 56 24)
			(24 56 57 25)
			(25 57 58 26)
		);
	}

	outlet
	{
		type patch;
		faces
		(
			(18 50 49 17)
			(17 49 48 16)
			(16 48 63 31)
			(31 63 62 30)
		);
	}

	cylinder
	{
		type wall;
		faces
		(
			( 0 32 33  1)
			( 1 33 34  2)
			( 2 34 35  3)
			( 3 35 36  4)
			( 4 36 37  5)
			( 5 37 38  6)
			( 6 38 39  7)
			( 7 39 32  0)
		);
	}

	top
	{
		type symmetryPlane;
		faces
		(
			(22 54 53 21)
			(21 53 52 20)
			(20 52 51 19)
			(19 51 50 18)
		);
	}

	bottom
	{
		type symmetryPlane;
		faces
		(
			(26 58 59 27)
			(27 59 60 28)
			(28 60 61 29)
			(29 61 62 30)
		);
	}

);