circular-cylinder-re110-B/system/blockMeshDict.example

// Mesh generated on 08-Mar-2021
// Local directory: /Users/fbisetti/teaching/ASE347/SP-2021/OF-assignments/of2/simulations/mesh
// Username: fbisetti


// Lf (fore)  =  4.00000e+00
// Lw (wake)  =  6.00000e+00
// R  (outer) =  1.00000e+00
// H  (top/bottom) = 4.00000

FoamFile
{
    version  2.0;
    format   ascii;
    class    dictionary;
    object   blockMeshDict;
}

convertToMeters 1.0;

vertices
(
   ( 5.0000000000000000e-01  0.0000000000000000e+00 -5.0000000000000003e-02) // 0
   ( 3.5355339059327379e-01  3.5355339059327373e-01 -5.0000000000000003e-02) // 1
   ( 3.0616169978683830e-17  5.0000000000000000e-01 -5.0000000000000003e-02) // 2
   (-3.5355339059327373e-01  3.5355339059327379e-01 -5.0000000000000003e-02) // 3
   (-5.0000000000000000e-01  6.1232339957367660e-17 -5.0000000000000003e-02) // 4
   (-3.5355339059327384e-01 -3.5355339059327373e-01 -5.0000000000000003e-02) // 5
   (-9.1848509936051484e-17 -5.0000000000000000e-01 -5.0000000000000003e-02) // 6
   ( 3.5355339059327368e-01 -3.5355339059327384e-01 -5.0000000000000003e-02) // 7
   ( 1.0000000000000000e+00  0.0000000000000000e+00 -5.0000000000000003e-02) // 8
   ( 7.0710678118654757e-01  7.0710678118654746e-01 -5.0000000000000003e-02) // 9
   ( 6.1232339957367660e-17  1.0000000000000000e+00 -5.0000000000000003e-02) // 10
   (-7.0710678118654746e-01  7.0710678118654757e-01 -5.0000000000000003e-02) // 11
   (-1.0000000000000000e+00  1.2246467991473532e-16 -5.0000000000000003e-02) // 12
   (-7.0710678118654768e-01 -7.0710678118654746e-01 -5.0000000000000003e-02) // 13
   (-1.8369701987210297e-16 -1.0000000000000000e+00 -5.0000000000000003e-02) // 14
   ( 7.0710678118654735e-01 -7.0710678118654768e-01 -5.0000000000000003e-02) // 15
   ( 6.0000000000000000e+00  0.0000000000000000e+00 -5.0000000000000003e-02) // 16
   ( 6.0000000000000000e+00  7.0710678118654746e-01 -5.0000000000000003e-02) // 17
   ( 6.0000000000000000e+00  4.0000000000000000e+00 -5.0000000000000003e-02) // 18
   ( 7.0710678118654757e-01  4.0000000000000000e+00 -5.0000000000000003e-02) // 19
   ( 0.0000000000000000e+00  4.0000000000000000e+00 -5.0000000000000003e-02) // 20
   (-7.0710678118654746e-01  4.0000000000000000e+00 -5.0000000000000003e-02) // 21
   (-4.0000000000000000e+00  4.0000000000000000e+00 -5.0000000000000003e-02) // 22
   (-4.0000000000000000e+00  7.0710678118654757e-01 -5.0000000000000003e-02) // 23
   (-4.0000000000000000e+00  0.0000000000000000e+00 -5.0000000000000003e-02) // 24
   (-4.0000000000000000e+00 -7.0710678118654757e-01 -5.0000000000000003e-02) // 25
   (-4.0000000000000000e+00 -4.0000000000000000e+00 -5.0000000000000003e-02) // 26
   (-7.0710678118654746e-01 -4.0000000000000000e+00 -5.0000000000000003e-02) // 27
   ( 0.0000000000000000e+00 -4.0000000000000000e+00 -5.0000000000000003e-02) // 28
   ( 7.0710678118654757e-01 -4.0000000000000000e+00 -5.0000000000000003e-02) // 29
   ( 6.0000000000000000e+00 -4.0000000000000000e+00 -5.0000000000000003e-02) // 30
   ( 6.0000000000000000e+00 -7.0710678118654746e-01 -5.0000000000000003e-02) // 31
   ( 5.0000000000000000e-01  0.0000000000000000e+00  5.0000000000000003e-02) // 32
   ( 3.5355339059327379e-01  3.5355339059327373e-01  5.0000000000000003e-02) // 33
   ( 3.0616169978683830e-17  5.0000000000000000e-01  5.0000000000000003e-02) // 34
   (-3.5355339059327373e-01  3.5355339059327379e-01  5.0000000000000003e-02) // 35
   (-5.0000000000000000e-01  6.1232339957367660e-17  5.0000000000000003e-02) // 36
   (-3.5355339059327384e-01 -3.5355339059327373e-01  5.0000000000000003e-02) // 37
   (-9.1848509936051484e-17 -5.0000000000000000e-01  5.0000000000000003e-02) // 38
   ( 3.5355339059327368e-01 -3.5355339059327384e-01  5.0000000000000003e-02) // 39
   ( 1.0000000000000000e+00  0.0000000000000000e+00  5.0000000000000003e-02) // 40
   ( 7.0710678118654757e-01  7.0710678118654746e-01  5.0000000000000003e-02) // 41
   ( 6.1232339957367660e-17  1.0000000000000000e+00  5.0000000000000003e-02) // 42
   (-7.0710678118654746e-01  7.0710678118654757e-01  5.0000000000000003e-02) // 43
   (-1.0000000000000000e+00  1.2246467991473532e-16  5.0000000000000003e-02) // 44
   (-7.0710678118654768e-01 -7.0710678118654746e-01  5.0000000000000003e-02) // 45
   (-1.8369701987210297e-16 -1.0000000000000000e+00  5.0000000000000003e-02) // 46
   ( 7.0710678118654735e-01 -7.0710678118654768e-01  5.0000000000000003e-02) // 47
   ( 6.0000000000000000e+00  0.0000000000000000e+00  5.0000000000000003e-02) // 48
   ( 6.0000000000000000e+00  7.0710678118654746e-01  5.0000000000000003e-02) // 49
   ( 6.0000000000000000e+00  4.0000000000000000e+00  5.0000000000000003e-02) // 50
   ( 7.0710678118654757e-01  4.0000000000000000e+00  5.0000000000000003e-02) // 51
   ( 0.0000000000000000e+00  4.0000000000000000e+00  5.0000000000000003e-02) // 52
   (-7.0710678118654746e-01  4.0000000000000000e+00  5.0000000000000003e-02) // 53
   (-4.0000000000000000e+00  4.0000000000000000e+00  5.0000000000000003e-02) // 54
   (-4.0000000000000000e+00  7.0710678118654757e-01  5.0000000000000003e-02) // 55
   (-4.0000000000000000e+00  0.0000000000000000e+00  5.0000000000000003e-02) // 56
   (-4.0000000000000000e+00 -7.0710678118654757e-01  5.0000000000000003e-02) // 57
   (-4.0000000000000000e+00 -4.0000000000000000e+00  5.0000000000000003e-02) // 58
   (-7.0710678118654746e-01 -4.0000000000000000e+00  5.0000000000000003e-02) // 59
   ( 0.0000000000000000e+00 -4.0000000000000000e+00  5.0000000000000003e-02) // 60
   ( 7.0710678118654757e-01 -4.0000000000000000e+00  5.0000000000000003e-02) // 61
   ( 6.0000000000000000e+00 -4.0000000000000000e+00  5.0000000000000003e-02) // 62
   ( 6.0000000000000000e+00 -7.0710678118654746e-01  5.0000000000000003e-02) // 63
);

blocks
(

   // block 0
   hex (0 8 9 1 32 40 41 33) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 1
   hex (1 9 10 2 33 41 42 34) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 2
   hex (2 10 11 3 34 42 43 35) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 3
   hex (3 11 12 4 35 43 44 36) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 4
   hex (4 12 13 5 36 44 45 37) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 5
   hex (5 13 14 6 37 45 46 38) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 6
   hex (6 14 15 7 38 46 47 39) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 7
   hex (7 15 8 0 39 47 40 32) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 8
   hex (8 16 17 9 40 48 49 41) (30 20 1) simpleGrading ( 4.00000e+00  1.00000e+00 1.0)

   // block 9
   hex (9 17 18 19 41 49 50 51) (30 30 1) simpleGrading ( 4.00000e+00  4.00000e+00 1.0)

   // block 10
   hex (10 9 19 20 42 41 51 52) (20 30 1) simpleGrading ( 1.00000e+00  4.00000e+00 1.0)

   // block 11
   hex (11 10 20 21 43 42 52 53) (20 30 1) simpleGrading ( 1.00000e+00  4.00000e+00 1.0)

   // block 12
   hex (23 11 21 22 55 43 53 54) (15 30 1) simpleGrading ( 2.50000e-01  4.00000e+00 1.0)

   // block 13
   hex (24 12 11 23 56 44 43 55) (15 20 1) simpleGrading ( 2.50000e-01  1.00000e+00 1.0)

   // block 14
   hex (25 13 12 24 57 45 44 56) (15 20 1) simpleGrading ( 2.50000e-01  1.00000e+00 1.0)

   // block 15
   hex (26 27 13 25 58 59 45 57) (15 30 1) simpleGrading ( 2.50000e-01  2.50000e-01 1.0)

   // block 16
   hex (27 28 14 13 59 60 46 45) (20 30 1) simpleGrading ( 1.00000e+00  2.50000e-01 1.0)

   // block 17
   hex (28 29 15 14 60 61 47 46) (20 30 1) simpleGrading ( 1.00000e+00  2.50000e-01 1.0)

   // block 18
   hex (29 30 31 15 61 62 63 47) (30 30 1) simpleGrading ( 4.00000e+00  2.50000e-01 1.0)

   // block 19
   hex (15 31 16 8 47 63 48 40) (30 20 1) simpleGrading ( 4.00000e+00  1.00000e+00 1.0)

);

edges
(

arc 0 1 ( 4.61940e-01  1.91342e-01 -5.00000e-02)
arc 8 9 ( 9.23880e-01  3.82683e-01 -5.00000e-02)
arc 32 33 ( 4.61940e-01  1.91342e-01  5.00000e-02)
arc 40 41 ( 9.23880e-01  3.82683e-01  5.00000e-02)
arc 1 2 ( 1.91342e-01  4.61940e-01 -5.00000e-02)
arc 9 10 ( 3.82683e-01  9.23880e-01 -5.00000e-02)
arc 33 34 ( 1.91342e-01  4.61940e-01  5.00000e-02)
arc 41 42 ( 3.82683e-01  9.23880e-01  5.00000e-02)
arc 2 3 (-1.91342e-01  4.61940e-01 -5.00000e-02)
arc 10 11 (-3.82683e-01  9.23880e-01 -5.00000e-02)
arc 34 35 (-1.91342e-01  4.61940e-01  5.00000e-02)
arc 42 43 (-3.82683e-01  9.23880e-01  5.00000e-02)
arc 3 4 (-4.61940e-01  1.91342e-01 -5.00000e-02)
arc 11 12 (-9.23880e-01  3.82683e-01 -5.00000e-02)
arc 35 36 (-4.61940e-01  1.91342e-01  5.00000e-02)
arc 43 44 (-9.23880e-01  3.82683e-01  5.00000e-02)
arc 4 5 (-4.61940e-01 -1.91342e-01 -5.00000e-02)
arc 12 13 (-9.23880e-01 -3.82683e-01 -5.00000e-02)
arc 36 37 (-4.61940e-01 -1.91342e-01  5.00000e-02)
arc 44 45 (-9.23880e-01 -3.82683e-01  5.00000e-02)
arc 5 6 (-1.91342e-01 -4.61940e-01 -5.00000e-02)
arc 13 14 (-3.82683e-01 -9.23880e-01 -5.00000e-02)
arc 37 38 (-1.91342e-01 -4.61940e-01  5.00000e-02)
arc 45 46 (-3.82683e-01 -9.23880e-01  5.00000e-02)
arc 6 7 ( 1.91342e-01 -4.61940e-01 -5.00000e-02)
arc 14 15 ( 3.82683e-01 -9.23880e-01 -5.00000e-02)
arc 38 39 ( 1.91342e-01 -4.61940e-01  5.00000e-02)
arc 46 47 ( 3.82683e-01 -9.23880e-01  5.00000e-02)
arc 7 0 ( 4.61940e-01 -1.91342e-01 -5.00000e-02)
arc 15 8 ( 9.23880e-01 -3.82683e-01 -5.00000e-02)
arc 39 32 ( 4.61940e-01 -1.91342e-01  5.00000e-02)
arc 47 40 ( 9.23880e-01 -3.82683e-01  5.00000e-02)

);

boundary
(

  inlet
  {
      type patch;
      faces
      (
         (22 54 55 23)
         (23 55 56 24)
         (24 56 57 25)
         (25 57 58 26)
      );
  }

  outlet
  {
      type patch;
      faces
      (
         (18 50 49 17)
         (17 49 48 16)
         (16 48 63 31)
         (31 63 62 30)
      );
  }

  cylinder
  {
      type wall;
      faces
      (
         (0 32 33 1)
         (1 33 34 2)
         (2 34 35 3)
         (3 35 36 4)
         (4 36 37 5)
         (5 37 38 6)
         (6 38 39 7)
         (7 39 32 0)
      );
  }

  top
  {
      type symmetryPlane;
      faces
      (
         (22 54 53 21)
         (21 53 52 20)
         (20 52 51 19)
         (19 51 50 18)
      );
  }

  bottom
  {
      type symmetryPlane;
      faces
      (
         (26 58 59 27)
         (27 59 60 28)
         (28 60 61 29)
         (29 61 62 30)
      );
  }

);
